In [636]:
import pandas as pd

In [637]:
#carregar arquivo para dataframe pandas
dados = pd.read_csv("teste.csv")
dados

    Nome  Idade Cidade    Saldo
0    Vit     25     SP  3200.50
1    Ana     30     RJ  4100.00
2   João     22     BH  2890.75
3  Lucas     28     SP  5000.10
4  Maria     35     MG  3900.00

In [638]:
#formato
dados.shape

(5, 4)

In [639]:
#resumo estatistico de colunas numericas
dados.describe

<bound method NDFrame.describe of     Nome  Idade Cidade    Saldo
0    Vit     25     SP  3200.50
1    Ana     30     RJ  4100.00
2   João     22     BH  2890.75
3  Lucas     28     SP  5000.10
4  Maria     35     MG  3900.00>

In [640]:
#primeiros registros 
dados.head

<bound method NDFrame.head of     Nome  Idade Cidade    Saldo
0    Vit     25     SP  3200.50
1    Ana     30     RJ  4100.00
2   João     22     BH  2890.75
3  Lucas     28     SP  5000.10
4  Maria     35     MG  3900.00>

In [641]:
#ultimos registros, com parametros 
dados.tail(2)

    Nome  Idade Cidade   Saldo
3  Lucas     28     SP  5000.1
4  Maria     35     MG  3900.0

In [642]:
#filtrar por nome da coluna 
dados[["Saldo"]]

     Saldo
0  3200.50
1  4100.00
2  2890.75
3  5000.10
4  3900.00

In [643]:
#filtrar linhas por indice
dados.loc[1:3]

    Nome  Idade Cidade    Saldo
1    Ana     30     RJ  4100.00
2   João     22     BH  2890.75
3  Lucas     28     SP  5000.10

In [644]:
#linhas 1 e 3
dados.loc[[1,3]]

    Nome  Idade Cidade   Saldo
1    Ana     30     RJ  4100.0
3  Lucas     28     SP  5000.1

In [645]:
#filtro
dados.loc[dados['Nome'] == "João"]

   Nome  Idade Cidade    Saldo
2  João     22     BH  2890.75

In [646]:
#outra condição 
dados.loc[dados["Saldo"] > 2800]

    Nome  Idade Cidade    Saldo
0    Vit     25     SP  3200.50
1    Ana     30     RJ  4100.00
2   João     22     BH  2890.75
3  Lucas     28     SP  5000.10
4  Maria     35     MG  3900.00

In [647]:
#atribuimos resultados a variavel, criando outro df
Saldo2 = dados.loc[dados["Idade"] > 15]
print(Saldo2)

    Nome  Idade Cidade    Saldo
0    Vit     25     SP  3200.50
1    Ana     30     RJ  4100.00
2   João     22     BH  2890.75
3  Lucas     28     SP  5000.10
4  Maria     35     MG  3900.00

In [648]:
#definimos so algumas colunas
Saldo3 = dados[['Cidade', 'Nome']].loc[dados['Saldo'] > 3200]
print(Saldo3)

  Cidade   Nome
0     SP    Vit
1     RJ    Ana
3     SP  Lucas
4     MG  Maria

In [649]:
#series, unica coluna 
#pode ser criada a partir da listas, arrau do numpy ou coluna do dataframe
s1 = pd.Series([2,5,3,34,54,23,1,16])
print(s1)

0     2
1     5
2     3
3    34
4    54
5    23
6     1
7    16
dtype: int64

In [650]:
#serie a partir de um array do numpy 
import numpy as np
array1 = np.array([2,5,3,34,54,23,1,16])
s2 = pd.Series(array1)
print(s2)

0     2
1     5
2     3
3    34
4    54
5    23
6     1
7    16
dtype: int32

In [651]:
#serie a partir de um dataframe
s3 = dados["Cidade"]
print(s3)
type(s3)

0    SP
1    RJ
2    BH
3    SP
4    MG
Name: Cidade, dtype: object

pandas.core.series.Series

In [652]:
#note a diferença, temos um data frame
d4 = dados[["Cidade"]]
type(d4)

pandas.core.frame.DataFrame

In [653]:
#Renomear
dados.rename(columns={"Saldo": "Banco"})

    Nome  Idade Cidade    Banco
0    Vit     25     SP  3200.50
1    Ana     30     RJ  4100.00
2   João     22     BH  2890.75
3  Lucas     28     SP  5000.10
4  Maria     35     MG  3900.00

In [654]:
#para a alteração não persiste 
dados.head(1)

  Nome  Idade Cidade   Saldo
0  Vit     25     SP  3200.5

In [655]:
#para persistir 
dados.rename(columns={"Saldo":"Banco"}, inplace=True)

In [656]:
dados.head(1)

  Nome  Idade Cidade   Banco
0  Vit     25     SP  3200.5

In [657]:
#excluir coluna
dados.drop('Idade', axis=1, inplace=True)
print(dados)

    Nome Cidade    Banco
0    Vit     SP  3200.50
1    Ana     RJ  4100.00
2   João     BH  2890.75
3  Lucas     SP  5000.10
4  Maria     MG  3900.00

In [658]:
dados.head(1)

  Nome Cidade   Banco
0  Vit     SP  3200.5

In [659]:
#Verificar dados nulos
dados.isnull()

    Nome  Cidade  Banco
0  False   False  False
1  False   False  False
2  False   False  False
3  False   False  False
4  False   False  False

In [660]:
#Verificar dados nulos
dados.isnull().sum()

Nome      0
Cidade    0
Banco     0
dtype: int64

In [661]:
#retirar colunas com NaN
dados.dropna()

    Nome Cidade    Banco
0    Vit     SP  3200.50
1    Ana     RJ  4100.00
2   João     BH  2890.75
3  Lucas     SP  5000.10
4  Maria     MG  3900.00

In [662]:
#preencher dados faltantes
dados['Cidade'].fillna(0, inplace= True)

In [663]:
#iloc
dados.iloc[0:3, 0:3]

   Nome Cidade    Banco
0   Vit     SP  3200.50
1   Ana     RJ  4100.00
2  João     BH  2890.75